#include <iostream>
#include <shooter.h>
#include <map.h>

shooter::shooter(const float x, const float y, const sf::String file): life(true), t_x(x), t_y(y), t_dx(0), t_dy(0),
																 t_File(file), t_dir(up), t_CurrentFrame(0), t_Speed(0) 
//определение конструктора стрелка с параметрами-его координатами и файлом с текстурой; устанавливаем значение полей по умолчанию: 
																										//приращение координат = 0, 
																										//направление движения - вверх,
																										//начальный фрейм - нулевой,
																										//начальная скорость = 0
{
	t_Texture.loadFromFile(t_File); //загружаем текстуру из файла
	t_Sprite.setTexture(t_Texture); //устанавливаем спрайт из текстуры
	t_Sprite.setTextureRect(sf::IntRect(0, 0, 64, 64)); //обрезаем спрайт стрелка до его первого фрейма
	t_Sprite.setPosition(x, y); //устанавливаем спрайт по координатам (x,y)
}

shooter::~shooter() //определение деструктора предка
{
	std::cout << "destroyed\n"; //проверка удаления объекта класса - печать в консоль
}

void shooter::animate(const sf::Int64 time) //определение функции анимации стрелка
{
	t_CurrentFrame += 0.005 * time; //приращаем фрейм, где 0.005 - "темп" ускорения его приращения
	if (t_CurrentFrame >= 4) //если достигли последнего фрейма
		t_CurrentFrame -= 4; //переходим на начальный фрейм

	if (t_dx > 0) //если двигались вправо
		t_Sprite.setTextureRect(sf::IntRect(0 + 64 * (int)t_CurrentFrame, 1 * 64, 64, 64)); //происходит анимация по 2 строчке спрайта, где он повернут направо

	if (t_dx < 0) //если двигались влево
		t_Sprite.setTextureRect(sf::IntRect(0 + 64 * (int)t_CurrentFrame, 3 * 64, 64, 64)); //происходит анимация по 4 строчке спрайта, где он повернут налево

	if (t_dy > 0) //если двигались вниз
		t_Sprite.setTextureRect(sf::IntRect(0 + 64 * (int)t_CurrentFrame, 2 * 64, 64, 64)); //происходит анимация по 3 строчке спрайта, где он повернут вниз

	if (t_dy < 0) //если двигались ввверх
		t_Sprite.setTextureRect(sf::IntRect(0 + 64 * (int)t_CurrentFrame, 0, 64, 64)); //происходит анимация по 1 строчке спрайта, где он повернут вверх

}

void shooter::collapse() //определение функции-уничтожения стрелка
{
	life = false; //убили
	t_Sprite.setPosition(0, 0); //убрали
}

void shooter::map_interaction(map& map) //определение функции-взаимодействия стрелка с картой
{
	for (int i = (t_y + 16) / 64; i < (t_y + 64 - 16) / 64; ++i) //проходим по пикселям спрайта построчно 
		for (int j = (t_x + 16) / 64; j < (t_x + 64 - 16) / 64; ++j) //проходим по пикселям спрайта по столбикам
		//поставили приращение +- 16, так как не весь спрайт 64X64 занят именно стрелком, есть свободное пространство
		{ 
			char tile = map.get_tile(i, j); //в переменную tile заносим значение тайла карты, на которой находится пиксель спрайта стрелка

			if (tile != ' ') //если столкнулся со стенкой
			{
				if (t_dy > 0) //если двигался вниз
					t_y = i * 64 - 64 + 16; //перемещаем на начало тайла

				if (t_dy < 0) //если двигался вверх
					t_y = i * 64 + 64 - 16; //перемещаем на начало тайла

				if (t_dx > 0) //если двигался вправо
					t_x = j * 64 - 64 + 16; //перемещаем на начало тайла

				if (t_dx < 0) //если двигался влево
					t_x = j * 64 + 64 - 16; //перемещаем на начало тайла
			}
		}
}